wisteria-1c/Конфигурация/InformationRegisters/ДополнительныеРеквизитыБизнесПриложение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеРеквизитыБизнесПриложение</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыБизнесПриложение</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыБизнесПриложение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/ДополнительныеРеквизитыБизнесПриложение/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗначенияРеквизитовОбъектов(Ссылки, Знач Реквизиты = "") Экспорт
	
	Если ТипЗнч(Ссылки) = Тип("Массив") Тогда
		МассивСсылок = Ссылки;
	Иначе
		МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ссылки);
	КонецЕсли;
	
	Если ТипЗнч(Реквизиты) = Тип("Массив") Тогда
		Если Реквизиты.Количество() = 0 Тогда
			Реквизиты = ПланыВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение.СписокВсехДоступныхРеквизитов();
		КонецЕсли;
	Иначе
		Если ПустаяСтрока(Реквизиты) Тогда
			Реквизиты = ПланыВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение.СписокВсехДоступныхРеквизитов();
		Иначе
			Реквизиты = СтрРазделить(Реквизиты, ",", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Результат = Новый Соответствие;
	Для Каждого Ссылка Из МассивСсылок Цикл
		
		Результат[Ссылка] = Новый Структура;
		Для Каждого Реквизит Из Реквизиты Цикл
			Результат[Ссылка].Вставить(Реквизит);
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеРеквизитыБизнесПриложение.Значение КАК Значение,
		|	ДополнительныеРеквизитыБизнесПриложение.Свойство КАК Свойство,
		|	ДополнительныеРеквизитыБизнесПриложение.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.ДополнительныеРеквизитыБизнесПриложение КАК ДополнительныеРеквизитыБизнесПриложение
		|ГДЕ
		|	ДополнительныеРеквизитыБизнесПриложение.Объект В (&МассивСсылок)";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	ДанныеСвойств = Запрос.Выполнить().Выгрузить();
	Если ДанныеСвойств.Количество() = 0 Тогда
		Если ТипЗнч(Ссылки) = Тип("Массив") Тогда
			Возврат Результат;
		Иначе
			Возврат Результат[МассивСсылок[0]];
		КонецЕсли;
	КонецЕсли;
	
	Свойства = ПланыВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение.ДоступныеСвойства(Реквизиты);
	
	Для Каждого Ссылка Из МассивСсылок Цикл
		Для Каждого Реквизит Из Реквизиты Цикл
			
			Свойство = Свойства[Реквизит];
			Если Свойство = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначениеРеквизита = ДанныеСвойств.НайтиСтроки(Новый Структура("Свойство,Объект", Свойство, Ссылка));
			Если Не ЗначениеРеквизита.Количество() Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначениеРеквизита = ЗначениеРеквизита[0].Значение;
			Результат[Ссылка][Реквизит] = ЗначениеРеквизита;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ТипЗнч(Ссылки) = Тип("Массив") Тогда
		Возврат Результат;
	Иначе
		Возврат Результат[МассивСсылок[0]];
	КонецЕсли;
	
КонецФункции

Процедура СохранитьЗначения(Ссылка, ЗначенияРеквизитов) Экспорт
	
	Реквизиты = Новый Массив;
	Для Каждого КлючЗначение Из ЗначенияРеквизитов Цикл
		Реквизиты.Добавить(КлючЗначение.Ключ);
	КонецЦикла;
	
	Свойства = ПланыВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение.ДоступныеСвойства(Реквизиты);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Ссылка);
	
	Для Каждого КлючЗначение Из ЗначенияРеквизитов Цикл
		
		Реквизит = КлючЗначение.Ключ;
		Значение = КлючЗначение.Значение;
		
		Свойство = Свойства[Реквизит];
		Если Свойство = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Запись = НаборЗаписей.Добавить();
		Запись.Объект = Ссылка;
		Запись.Свойство = Свойство;
		Запись.Значение = Значение;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
